stm32duino/Arduino_Core_STM32/system/Drivers/STM32U0xx_HAL_Driver/Inc/stm32u0xx_ll_dmamux.h
/**
  ******************************************************************************
  * @file    stm32u0xx_ll_dmamux.h
  * @author  GPM Application Team
  * @brief   Header file of DMAMUX LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32U0xx_LL_DMAMUX_H
#define STM32U0xx_LL_DMAMUX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u0xx.h"

/** @addtogroup STM32U0xx_LL_Driver
  * @{
  */

#if defined (DMAMUX1)

/** @defgroup DMAMUX_LL DMAMUX
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup DMAMUX_LL_Private_Constants DMAMUX Private Constants
  * @{
  */
/* Define used to get DMAMUX CCR register size */
#define DMAMUX_CCR_SIZE                   0x00000004UL

/* Define used to get DMAMUX RGCR register size */
#define DMAMUX_RGCR_SIZE                  0x00000004UL
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup DMAMUX_LL_Exported_Constants DMAMUX Exported Constants
  * @{
  */
/** @defgroup DMAMUX_LL_EC_CLEAR_FLAG Clear Flags Defines
  * @brief    Flags defines which can be used with LL_DMAMUX_WriteReg function
  * @{
  */
#define LL_DMAMUX_CFR_CSOF0               DMAMUX_CFR_CSOF0       /*!< Synchronization Event Overrun Flag Channel 0  */
#define LL_DMAMUX_CFR_CSOF1               DMAMUX_CFR_CSOF1       /*!< Synchronization Event Overrun Flag Channel 1  */
#define LL_DMAMUX_CFR_CSOF2               DMAMUX_CFR_CSOF2       /*!< Synchronization Event Overrun Flag Channel 2  */
#define LL_DMAMUX_CFR_CSOF3               DMAMUX_CFR_CSOF3       /*!< Synchronization Event Overrun Flag Channel 3  */
#define LL_DMAMUX_CFR_CSOF4               DMAMUX_CFR_CSOF4       /*!< Synchronization Event Overrun Flag Channel 4  */
#define LL_DMAMUX_CFR_CSOF5               DMAMUX_CFR_CSOF5       /*!< Synchronization Event Overrun Flag Channel 5  */
#define LL_DMAMUX_CFR_CSOF6               DMAMUX_CFR_CSOF6       /*!< Synchronization Event Overrun Flag Channel 6  */
#if defined(DMA2)
#define LL_DMAMUX_CFR_CSOF7               DMAMUX_CFR_CSOF7       /*!< Synchronization Event Overrun Flag Channel 7  */
#define LL_DMAMUX_CFR_CSOF8               DMAMUX_CFR_CSOF8       /*!< Synchronization Event Overrun Flag Channel 8  */
#define LL_DMAMUX_CFR_CSOF9               DMAMUX_CFR_CSOF9       /*!< Synchronization Event Overrun Flag Channel 9  */
#define LL_DMAMUX_CFR_CSOF10              DMAMUX_CFR_CSOF10      /*!< Synchronization Event Overrun Flag Channel 10 */
#define LL_DMAMUX_CFR_CSOF11              DMAMUX_CFR_CSOF11      /*!< Synchronization Event Overrun Flag Channel 11 */
#endif /* DMA2 */
#define LL_DMAMUX_RGCFR_RGCOF0            DMAMUX_RGCFR_COF0      /*!< Request Generator 0 Trigger Event Overrun Flag */
#define LL_DMAMUX_RGCFR_RGCOF1            DMAMUX_RGCFR_COF1      /*!< Request Generator 1 Trigger Event Overrun Flag */
#define LL_DMAMUX_RGCFR_RGCOF2            DMAMUX_RGCFR_COF2      /*!< Request Generator 2 Trigger Event Overrun Flag */
#define LL_DMAMUX_RGCFR_RGCOF3            DMAMUX_RGCFR_COF3      /*!< Request Generator 3 Trigger Event Overrun Flag */
/**
  * @}
  */

/** @defgroup DMAMUX_LL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with LL_DMAMUX_ReadReg function
  * @{
  */
#define LL_DMAMUX_CSR_SOF0                DMAMUX_CSR_SOF0       /*!< Synchronization Event Overrun Flag Channel 0  */
#define LL_DMAMUX_CSR_SOF1                DMAMUX_CSR_SOF1       /*!< Synchronization Event Overrun Flag Channel 1  */
#define LL_DMAMUX_CSR_SOF2                DMAMUX_CSR_SOF2       /*!< Synchronization Event Overrun Flag Channel 2  */
#define LL_DMAMUX_CSR_SOF3                DMAMUX_CSR_SOF3       /*!< Synchronization Event Overrun Flag Channel 3  */
#define LL_DMAMUX_CSR_SOF4                DMAMUX_CSR_SOF4       /*!< Synchronization Event Overrun Flag Channel 4  */
#define LL_DMAMUX_CSR_SOF5                DMAMUX_CSR_SOF5       /*!< Synchronization Event Overrun Flag Channel 5  */
#define LL_DMAMUX_CSR_SOF6                DMAMUX_CSR_SOF6       /*!< Synchronization Event Overrun Flag Channel 6  */
#if defined(DMA2)
#define LL_DMAMUX_CSR_SOF7                DMAMUX_CSR_SOF7       /*!< Synchronization Event Overrun Flag Channel 7  */
#define LL_DMAMUX_CSR_SOF8                DMAMUX_CSR_SOF8       /*!< Synchronization Event Overrun Flag Channel 8  */
#define LL_DMAMUX_CSR_SOF9                DMAMUX_CSR_SOF9       /*!< Synchronization Event Overrun Flag Channel 9  */
#define LL_DMAMUX_CSR_SOF10               DMAMUX_CSR_SOF10      /*!< Synchronization Event Overrun Flag Channel 10 */
#define LL_DMAMUX_CSR_SOF11               DMAMUX_CSR_SOF11      /*!< Synchronization Event Overrun Flag Channel 11 */
#endif /* DMA2 */
#define LL_DMAMUX_RGSR_RGOF0              DMAMUX_RGSR_OF0       /*!< Request Generator 0 Trigger Event Overrun Flag */
#define LL_DMAMUX_RGSR_RGOF1              DMAMUX_RGSR_OF1       /*!< Request Generator 1 Trigger Event Overrun Flag */
#define LL_DMAMUX_RGSR_RGOF2              DMAMUX_RGSR_OF2       /*!< Request Generator 2 Trigger Event Overrun Flag */
#define LL_DMAMUX_RGSR_RGOF3              DMAMUX_RGSR_OF3       /*!< Request Generator 3 Trigger Event Overrun Flag */
/**
  * @}
  */

/** @defgroup DMAMUX_LL_EC_IT IT Defines
  * @brief    IT defines which can be used with LL_DMA_ReadReg and  LL_DMAMUX_WriteReg functions
  * @{
  */
#define LL_DMAMUX_CCR_SOIE          DMAMUX_CxCR_SOIE   /*!< Synchronization Event Overrun Interrupt */
#define LL_DMAMUX_RGCR_RGOIE        DMAMUX_RGxCR_OIE   /*!< Request Generation Trigger Event Overrun Interrupt */
/**
  * @}
  */

/** @defgroup DMAMUX_LL_EC_REQUEST Transfer request
  * @{
  */
#define LL_DMAMUX_REQ_MEM2MEM             0x00000000U  /*!< memory to memory transfer      */
#define LL_DMAMUX_REQ_GENERATOR0          0x00000001U  /*!< DMAMUX request generator 0     */
#define LL_DMAMUX_REQ_GENERATOR1          0x00000002U  /*!< DMAMUX request generator 1     */
#define LL_DMAMUX_REQ_GENERATOR2          0x00000003U  /*!< DMAMUX request generator 2     */
#define LL_DMAMUX_REQ_GENERATOR3          0x00000004U  /*!< DMAMUX request generator 3     */
#define LL_DMAMUX_REQ_ADC                 0x00000005U  /*!< DMAMUX ADC request             */
#if defined(AES)
#define LL_DMAMUX_REQ_AES_IN              0x00000006U  /*!< DMAMUX AES_IN        request   */
#define LL_DMAMUX_REQ_AES_OUT             0x00000007U  /*!< DMAMUX AES_OUT       request   */
#endif /* AES */
#define LL_DMAMUX_REQ_DAC_CH1             0x00000008U  /*!< DMAMUX DAC_CH1       request    */
#define LL_DMAMUX_REQ_I2C1_RX             0x00000009U  /*!< DMAMUX I2C1 RX       request   */
#define LL_DMAMUX_REQ_I2C1_TX             0x0000000AU  /*!< DMAMUX I2C1 TX       request   */
#define LL_DMAMUX_REQ_I2C2_RX             0x0000000BU  /*!< DMAMUX I2C2 RX       request   */
#define LL_DMAMUX_REQ_I2C2_TX             0x0000000CU  /*!< DMAMUX I2C2 TX       request   */
#define LL_DMAMUX_REQ_I2C3_RX             0x0000000DU  /*!< DMAMUX I2C3 RX       request   */
#define LL_DMAMUX_REQ_I2C3_TX             0x0000000EU  /*!< DMAMUX I2C3 TX       request   */
#if defined(I2C4)
#define LL_DMAMUX_REQ_I2C4_RX             0x0000000FU  /*!< DMAMUX I2C4 RX       request   */
#define LL_DMAMUX_REQ_I2C4_TX             0x00000010U  /*!< DMAMUX I2C4 TX       request   */
#endif /* I2C4 */
#define LL_DMAMUX_REQ_LPTIM1_IC1          0x00000011U  /*!< DMAMUX LPTIM1 IC1    request   */
#define LL_DMAMUX_REQ_LPTIM1_IC2          0x00000012U  /*!< DMAMUX LPTIM1 IC2    request   */
#define LL_DMAMUX_REQ_LPTIM1_IC3          0x00000013U  /*!< DMAMUX LPTIM1 IC3    request   */
#define LL_DMAMUX_REQ_LPTIM1_IC4          0x00000014U  /*!< DMAMUX LPTIM1 IC4    request   */
#define LL_DMAMUX_REQ_LPTIM1_UE           0x00000015U  /*!< DMAMUX LPTIM1 UE     request   */
#define LL_DMAMUX_REQ_LPTIM2_IC1          0x00000016U  /*!< DMAMUX LPTIM2 IC1    request   */
#define LL_DMAMUX_REQ_LPTIM2_IC2          0x00000017U  /*!< DMAMUX LPTIM2 IC2    request   */
#define LL_DMAMUX_REQ_LPTIM2_UE           0x00000018U  /*!< DMAMUX LPTIM2 UE     request   */
#if defined(LPTIM3)
#define LL_DMAMUX_REQ_LPTIM3_IC1          0x00000019U  /*!< DMAMUX LPTIM3 IC1    request   */
#define LL_DMAMUX_REQ_LPTIM3_IC2          0x0000001AU  /*!< DMAMUX LPTIM3 IC2    request   */
#define LL_DMAMUX_REQ_LPTIM3_IC3          0x0000001BU  /*!< DMAMUX LPTIM3 IC3    request   */
#define LL_DMAMUX_REQ_LPTIM3_IC4          0x0000001CU  /*!< DMAMUX LPTIM3 IC4    request   */
#define LL_DMAMUX_REQ_LPTIM3_UE           0x0000001DU  /*!< DMAMUX LPTIM3 UE     request   */
#endif /* LPTIM3 */
#define LL_DMAMUX_REQ_LPUART1_RX          0x0000001EU  /*!< DMAMUX LPUART1 RX    request   */
#define LL_DMAMUX_REQ_LPUART1_TX          0x0000001FU  /*!< DMAMUX LPUART1 TX    request   */
#define LL_DMAMUX_REQ_LPUART2_RX          0x00000020U  /*!< DMAMUX LPUART2 RX    request   */
#define LL_DMAMUX_REQ_LPUART2_TX          0x00000021U  /*!< DMAMUX LPUART2 TX    request   */
#if defined(LPUART3)
#define LL_DMAMUX_REQ_LPUART3_RX          0x00000022U  /*!< DMAMUX LPUART3 RX    request   */
#define LL_DMAMUX_REQ_LPUART3_TX          0x00000023U  /*!< DMAMUX LPUART3 TX    request   */
#endif /* LPUART */
#define LL_DMAMUX_REQ_SPI1_RX             0x00000024U  /*!< DMAMUX SPI1 RX       request   */
#define LL_DMAMUX_REQ_SPI1_TX             0x00000025U  /*!< DMAMUX SPI1 TX       request   */
#define LL_DMAMUX_REQ_SPI2_RX             0x00000026U  /*!< DMAMUX SPI2 RX       request   */
#define LL_DMAMUX_REQ_SPI2_TX             0x00000027U  /*!< DMAMUX SPI2 TX       request   */
#if defined(SPI3)
#define LL_DMAMUX_REQ_SPI3_RX             0x00000028U  /*!< DMAMUX SPI3 RX       request   */
#define LL_DMAMUX_REQ_SPI3_TX             0x00000029U  /*!< DMAMUX SPI3 TX       request   */
#endif /* SPI3 */
#define LL_DMAMUX_REQ_TIM1_CH1            0x0000002AU  /*!< DMAMUX TIM1 CH1      request   */
#define LL_DMAMUX_REQ_TIM1_CH2            0x0000002BU  /*!< DMAMUX TIM1 CH2      request   */
#define LL_DMAMUX_REQ_TIM1_CH3            0x0000002CU  /*!< DMAMUX TIM1 CH3      request   */
#define LL_DMAMUX_REQ_TIM1_CH4            0x0000002DU  /*!< DMAMUX TIM1 CH4      request   */
#define LL_DMAMUX_REQ_TIM1_TRIG_COM       0x0000002EU  /*!< DMAMUX TIM1 TRIG COM request   */
#define LL_DMAMUX_REQ_TIM1_UP             0x0000002FU  /*!< DMAMUX TIM1 UP       request   */
#define LL_DMAMUX_REQ_TIM2_CH1            0x00000030U  /*!< DMAMUX TIM2 CH1      request   */
#define LL_DMAMUX_REQ_TIM2_CH2            0x00000031U  /*!< DMAMUX TIM2 CH2      request   */
#define LL_DMAMUX_REQ_TIM2_CH3            0x00000032U  /*!< DMAMUX TIM2 CH3      request   */
#define LL_DMAMUX_REQ_TIM2_CH4            0x00000033U  /*!< DMAMUX TIM2 CH4      request   */
#define LL_DMAMUX_REQ_TIM2_TRIG           0x00000034U  /*!< DMAMUX TIM2 TRIG     request   */
#define LL_DMAMUX_REQ_TIM2_UP             0x00000035U  /*!< DMAMUX TIM2 UP       request   */
#define LL_DMAMUX_REQ_TIM3_CH1            0x00000036U  /*!< DMAMUX TIM3 CH1      request   */
#define LL_DMAMUX_REQ_TIM3_CH2            0x00000037U  /*!< DMAMUX TIM3 CH2      request   */
#define LL_DMAMUX_REQ_TIM3_CH3            0x00000038U  /*!< DMAMUX TIM3 CH3      request   */
#define LL_DMAMUX_REQ_TIM3_CH4            0x00000039U  /*!< DMAMUX TIM3 CH4      request   */
#define LL_DMAMUX_REQ_TIM3_TRIG           0x0000003AU  /*!< DMAMUX TIM3 TRIG     request   */
#define LL_DMAMUX_REQ_TIM3_UP             0x0000003BU  /*!< DMAMUX TIM3 UP       request   */
#define LL_DMAMUX_REQ_TIM6_UP             0x0000003CU  /*!< DMAMUX TIM6 UP       request   */
#define LL_DMAMUX_REQ_TIM7_UP             0x0000003DU  /*!< DMAMUX TIM7 UP       request   */
#define LL_DMAMUX_REQ_TIM15_CH1           0x0000003EU  /*!< DMAMUX TIM15 CH1     request   */
#define LL_DMAMUX_REQ_TIM15_CH2           0x0000003FU  /*!< DMAMUX TIM15 CH2     request   */
#define LL_DMAMUX_REQ_TIM15_TRIG_COM      0x00000040U  /*!< DMAMUX TIM15 TRIG COMrequest   */
#define LL_DMAMUX_REQ_TIM15_UP            0x00000041U  /*!< DMAMUX TIM15 UP      request   */
#define LL_DMAMUX_REQ_TIM16_CH1           0x00000042U  /*!< DMAMUX TIM16 CH1     request   */
#define LL_DMAMUX_REQ_TIM16_COM           0x00000043U  /*!< DMAMUX TIM16 COM     request   */
#define LL_DMAMUX_REQ_TIM16_UP            0x00000044U  /*!< DMAMUX TIM16 UP      request   */
#define LL_DMAMUX_REQ_USART1_RX           0x00000045U  /*!< DMAMUX USART1 RX     request   */
#define LL_DMAMUX_REQ_USART1_TX           0x00000046U  /*!< DMAMUX USART1 TX     request   */
#define LL_DMAMUX_REQ_USART2_RX           0x00000047U  /*!< DMAMUX USART2 RX     request   */
#define LL_DMAMUX_REQ_USART2_TX           0x00000048U  /*!< DMAMUX USART2 TX     request   */
#define LL_DMAMUX_REQ_USART3_RX           0x00000049U  /*!< DMAMUX USART3 RX     request   */
#define LL_DMAMUX_REQ_USART3_TX           0x0000004AU  /*!< DMAMUX USART3 TX     request   */
#define LL_DMAMUX_REQ_USART4_RX           0x0000004BU  /*!< DMAMUX USART4 RX     request   */
#define LL_DMAMUX_REQ_USART4_TX           0x0000004CU  /*!< DMAMUX USART4 TX     request   */

